from work import DBManager

bdm = DBManager()

"Приветствую тебя пользователи в данной программе мы сможем отобразить тебе"
"вакансии 10 самых топовых it-компаний России"
"................."
"bdm.get_companies_and_vacancies_count(): получает список всех компаний и количество вакансий у каждой компании."
"................."
"bdm.get_all_vacancies(): получает список всех вакансий с указанием названия компании, названия вакансии и зарплаты и ссылки на вакансию."
"................."
"bdm.get_avg_salary(): получает среднюю зарплату по вакансиям."
"................."
"bdm.get_vacancies_with_higher_salary(): получает список всех вакансий, у которых зарплата выше средней по всем вакансиям."
"................."
"bdm.get_vacancies_with_keyword(): получает список всех вакансий, в названии которых содержатся переданные в метод слова, например “python”."

"Ниже напиши команду"

